taskt/Core/Automation/Commands/UIAutomationGroup/UIAutomationScrollPercentUIElementCommand.dot
digraph "UIAutomationScrollPercentUIElementCommand" {
"UIAutomationScrollPercentUIElementCommand" -> "AUIElementActionCommands";
"UIAutomationScrollPercentUIElementCommand" -> "ICanHandleUIElementScrollBar";
"AUIElementActionCommands" -> "ADoSomethingUIElementCommands";
"AUIElementActionCommands" -> "IUIElementActionProperties";
"ADoSomethingUIElementCommands" -> "AUIElementCoreCommands";
"ADoSomethingUIElementCommands" -> "IDoSomethingUIElementProperties";
"AUIElementCoreCommands" -> "ScriptCommand";
"AUIElementCoreCommands" -> "IUIElementCoreProperties";
"ScriptCommand" -> "IUIParameterProperties";
"ScriptCommand" -> "ICommandIDProperties";
}
