taskt/Core/Automation/Commands/UIAutomationGroup/UIAutomationScrollPercentUIElementCommand.puml
@startuml
UIAutomationScrollPercentUIElementCommand --> AUIElementActionCommands
UIAutomationScrollPercentUIElementCommand --> ICanHandleUIElementScrollBar
AUIElementActionCommands --> ADoSomethingUIElementCommands
AUIElementActionCommands --> IUIElementActionProperties
ADoSomethingUIElementCommands --> AUIElementCoreCommands
ADoSomethingUIElementCommands --> IDoSomethingUIElementProperties
AUIElementCoreCommands --> ScriptCommand
AUIElementCoreCommands --> IUIElementCoreProperties
ScriptCommand --> IUIParameterProperties
ScriptCommand --> ICommandIDProperties
@enduml
